// Написати функцію, яка приймає один аргумент. Якщо його не передати - то по замовчуванню цей аргумент дорівнює - 0
// При першому виклику, вона його запам'ятовує, при наступних переданий аргумент сумується з результатом попереднього виклику.
// Для цього використовуємо замикання (без нього тут не обійтися)
// Як це буде виглядати:
// const sum = sumFunction();
// sum(3) ; // 3
// sum(5); // 8
// sum(20); // 28
// Важливо: функція має повертати значення, а не просто виводити його в console.log
'use strict';
const sum = sumFunction();
console.log(sum(3));//3
console.log(sum(5)); ///8
console.log(sum(20)); ///28
function sumFunction(){
let sum = 0
return function (val) {
 return sum += val
}
} 
